/*
 * SiliconBackplane Chipcommon core hardware definitions.
 *
 * The chipcommon core provides chip identification, SB control,
 * jtag, 0/1/2 uarts, clock frequency control, a watchdog interrupt timer,
 * gpio interface, extbus, and support for serial and parallel flashes.
 *
 * $Id: sbchipc.h,v 1.4 Broadcom SDK $
 *
 * $Copyright: (c) 2016 Broadcom.
 * Broadcom Proprietary and Confidential. All rights reserved.$
 */

#ifndef	_SBCHIPC_H
#define	_SBCHIPC_H

#ifndef _LANGUAGE_ASSEMBLY

/* cpp contortions to concatenate w/arg prescan */
#ifndef PAD
#define	_PADLINE(line)	pad ## line
#define	_XSTR(line)	_PADLINE(line)
#define	PAD		_XSTR(__LINE__)
#endif	/* PAD */

typedef volatile struct {
	uint32	chipid;			/* 0x0 */
	uint32	capabilities;
	uint32	corecontrol;		/* corerev >= 1 */
    uint32  PAD[5];

	/* Interrupt control */
	uint32	intstatus;		/* 0x20 */
	uint32	intmask;
	uint32	chipcontrol;		/* 0x28, rev >= 11 */
	uint32	chipstatus;		/* 0x2c, rev >= 11 */

	/* Jtag Master */
	uint32	jtagcmd;		/* 0x30, rev >= 10 */
	uint32	jtagir;
	uint32	jtagdr;
	uint32	jtagctrl;

	/* serial flash interface registers */
    uint32  sflashcontrol;      /* 0x40 */
    uint32  sflashaddress;
    uint32  sflashdata;
    uint32  sflashpara;

	/* Silicon backplane configuration broadcast control */
	uint32	broadcastaddress;	/* 0x50 */
	uint32	broadcastdata;

	/* gpio - cleared only by power-on-reset */
	uint32	gpiopullup;		/* 0x58, corerev >= 20 */
	uint32	gpiopulldown;		/* 0x5c, corerev >= 20 */
	uint32	gpioin;			/* 0x60 */
	uint32	gpioout;
	uint32	gpioouten;
	uint32	gpiocontrol;
	uint32	gpiointpolarity;
	uint32	gpiointmask;

	/* GPIO events corerev >= 11 */
	uint32	gpioevent;
	uint32	gpioeventintmask;

	/* Watchdog timer */
	uint32	watchdog;		/* 0x80 */

	/* GPIO events corerev >= 11 */
	uint32	gpioeventintpolarity;

	/* GPIO based LED powersave registers corerev >= 16 */
	uint32  gpiotimerval;		/* 0x88 */
	uint32  gpiotimeroutmask;

	/* clock control */
	uint32	clockcontrol_n;		/* 0x90 */
	uint32	clockcontrol_sb;	/* aka m0 */
	uint32	clockcontrol_pci;	/* aka m1 */
	uint32	clockcontrol_m2;	/* mii/uart/mipsref */
	uint32	clockcontrol_m3;	/* cpu */
	uint32	clkdiv;			/* corerev >= 3 */
	uint32	PAD[2];

	/* pll delay registers (corerev >= 4) */
	uint32	pll_on_delay;		/* 0xb0 */
	uint32	fref_sel_delay;
	uint32	slow_clk_ctl;		/* 5 < corerev < 10 */
	uint32	PAD[1];

	/* Instaclock registers (corerev >= 10) */
	uint32	system_clk_ctl;		/* 0xc0 */
	uint32	clkstatestretch;
    uint32  PAD[2];

    /* Backplane address registers */
    uint32  bpaddrlow;          /* 0xd0 */
    uint32  bpaddrhigh;
    uint32  bpdata;
    uint32  PAD[1];
    uint32  bpindaccess;
    uint32  PAD[6];

	/* In AI chips, pointer to erom */
	uint32	eromptr;

	/* ExtBus control registers (corerev >= 3) */
    uint32  extif_cs2_config;      /* 0x100 */
    uint32  extif_cs2_waitcount;
    uint32  PAD[6];
    uint32  extif_cs3_config;
    uint32  extif_cs3_waitcount;
    uint32  pflash_config;
    uint32  pflash_waitcount;
    uint32  pflash_waitcount_pf1;
    uint32  PAD[3];

#if !defined(BCMDONGLEHOST)
	/* Enhanced Coexistance Interface (ECI) registers (corerev >= 21) */
	uint32	eci_output;		/* 0x140 */
	uint32	eci_control;
	uint32	eci_inputlo;
	uint32	eci_inputmi;
	uint32	eci_inputhi;
	uint32	eci_inputintpolaritylo;
	uint32	eci_inputintpolaritymi;
	uint32	eci_inputintpolarityhi;
	uint32	eci_intmasklo;
	uint32	eci_intmaskmi;
	uint32	eci_intmaskhi;
	uint32	eci_eventlo;
	uint32	eci_eventmi;
	uint32	eci_eventhi;
	uint32	eci_eventmasklo;
	uint32	eci_eventmaskmi;
	uint32	eci_eventmaskhi;
#else
    uint32  PAD[17];
#endif /* !defined(BCMDONGLEHOST) */


    /* Flash struct configuration registers */
    uint32  PAD[2];
    uint32  flashstrconfig;     /* 0x18c */
    uint32  PAD[4];

    /* NAND flash registers */
    uint32  nflashctrl;         /* 0x1a0 */
    uint32  nflashconf;
    uint32  nflashcoladdr;
    uint32  nflashrowaddr;
    uint32  nflashdata;
    uint32  nflashwaitcnt0;
    uint32  PAD[2];

    /*  Multi-Purpose Timer registers */
    uint32  MPcnt0;             /* 0x1c0 */
    uint32  MPcnt1;
    uint32  MPcnt2;
    uint32  MPcnt3;
    uint32  MPcnt_status;
    uint32  PAD[3];

	/* Clock control and hardware workarounds (corerev >= 20) */
	uint32	clk_ctl_st;		/* 0x1e0 */
    uint32  PAD[7];

    /* I2C registers (for keystone only) */
    uint8     i2c_slaveaddr;    /* 0x200, 1st I2C*/
    uint8     i2c_data;
    uint8     i2c_control;
    uint8     i2c_sts_ccr;      /* Status Reg(read), Clock Control Reg(write only) */
    uint8     i2c_extaddr;      /* externed slave address (10-bit addressing mode) */
    uint8     PAD[2];
    uint8     i2c_swreset;      /* software reset */
    uint8     PAD[8];
    uint8     i2c1_slaveaddr;   /* 0x210, 2nd I2C */
    uint8     i2c1_data;
    uint8     i2c1_control;
    uint8     i2c1_sts_ccr; 
    uint8     i2c1_extaddr; 
    uint8     PAD[2];
    uint8     i2c1_swreset; 
    uint8     PAD[104];

    /* SPI registers (for keystone only) */
    uint32    spi_mode_ctrl;    /* 0x280, SPI Mode Control registers */
    uint32    spi_config;       /* 0x284, SPI Configuration registers */
    uint32    spi_fifo_io;      /* 0x288, SPI FIFO IO registers */
    uint32    spi_status;       /* 0x28c, SPI Status registers */
    uint32    PAD[24];
    
    /* Serial Interface registers */
    uint32    SERIAL_IO_INTMASK; /* 0x2f0 */
    uint32    SERIAL_IO_SEL;     
    uint32    PAD[2];

	/* uarts */
	uint8	uart0data;		/* 0x300 */
	uint8	uart0imr;
	uint8	uart0fcr;
	uint8	uart0lcr;
	uint8	uart0mcr;
	uint8	uart0lsr;
	uint8	uart0msr;
	uint8	uart0scratch;
	uint8	PAD[248];		/* corerev >= 1 */

	uint8	uart1data;		/* 0x400 */
	uint8	uart1imr;
	uint8	uart1fcr;
	uint8	uart1lcr;
	uint8	uart1mcr;
	uint8	uart1lsr;
	uint8	uart1msr;
	uint8	uart1scratch;
	uint32	PAD[126];

	/* PMU registers (corerev >= 20) */
	uint32	pmucontrol;		/* 0x600 */
	uint32	pmucapabilities;
	uint32	pmustatus;
	uint32	res_state;
	uint32	res_pending;
	uint32	pmutimer;
	uint32	min_res_mask;
	uint32	max_res_mask;
	uint32	res_table_sel;
	uint32	res_dep_mask;
	uint32	res_updn_timer;
    uint32  PAD[2];
	uint32	pmuwatchdog;
    uint32  PAD[6];
	uint32	chipcontrol_addr;	/* 0x650 */
	uint32	chipcontrol_data;	/* 0x654 */
	uint32	regcontrol_addr;
	uint32	regcontrol_data;
	uint32	pllcontrol_addr;
	uint32	pllcontrol_data;
} chipcregs_t;

#endif /* _LANGUAGE_ASSEMBLY */

#define	CC_CHIPID		0
#define	CC_CAPABILITIES		4
#define CC_OTPST		0x10
#define CC_CHIPST		0x2c
#define	CC_JTAGCMD		0x30
#define	CC_JTAGIR		0x34
#define	CC_JTAGDR		0x38
#define	CC_JTAGCTRL		0x3c
#define	CC_WATCHDOG		0x80
#define	CC_CLKC_N		0x90
#define	CC_CLKC_M0		0x94
#define	CC_CLKC_M1		0x98
#define	CC_CLKC_M2		0x9c
#define	CC_CLKC_M3		0xa0
#define	CC_CLKDIV		0xa4
#define	CC_SYS_CLK_CTL		0xc0
#define	CC_CLK_CTL_ST		SI_CLK_CTL_ST
#define	CC_EROMPTR		0xfc
#define	PMU_CTL			0x600
#define	PMU_CAP			0x604
#define	PMU_ST			0x608
#define PMU_RES_STATE		0x60c
#define PMU_TIMER		0x614
#define	PMU_MIN_RES_MASK	0x618
#define	PMU_MAX_RES_MASK	0x61c
#define PMU_REG_CONTROL_ADDR	0x658
#define PMU_REG_CONTROL_DATA	0x65C
#define PMU_PLL_CONTROL_ADDR 	0x660
#define PMU_PLL_CONTROL_DATA 	0x664
